"设置..." = "Settings...";
"打开 Sized" = "Open Sized";
"退出 Sized" = "Quit Sized";

"轮盘样式" = "Wheel Style";
"尺寸分配" = "Size Assignment";
"应用规则" = "App Rules";
"预览窗口" = "Preview Window";
"设置" = "Settings";

"调整轮盘的尺寸、颜色、显示位置和动画效果。" = "Adjust wheel size, colors, placement, and animation.";
"基础外观" = "Basic Appearance";
"显示轮盘" = "Show wheel";
"轮盘大小" = "Wheel size";
"轮盘厚度" = "Wheel thickness";
"圆角半径" = "Corner radius";
"中心大小" = "Center size";
"中心圆角" = "Center corner radius";
"锁定到屏幕中心" = "Lock to screen center";
"隐藏无选择时的轮盘" = "Hide wheel when no selection";
"动画" = "Animation";
"出现动画" = "Appearance animation";
"大小变化动画" = "Size animation";
"角度变化动画" = "Angle animation";
"强调色" = "Accent Color";
"颜色模式" = "Color mode";
"主色" = "Primary color";
"使用渐变" = "Use gradient";
"渐变色" = "Gradient color";
"实时预览" = "Live Preview";
"模拟选择" = "Simulated selection";
"无选择" = "No selection";
"未选择" = "Not selected";

"调整窗口调整操作时显示的预览边框样式。" = "Adjust the preview outline shown while resizing windows.";
"基础设置" = "Basic Settings";
"显示目标尺寸预览" = "Show target size preview";
"预览内边距" = "Preview padding";
"边框样式" = "Border Style";
"边框宽度" = "Border width";
"边框颜色" = "Border color";
"背景颜色" = "Background color";
"过渡速度" = "Transition speed";
"秒" = "s";
"取消方式" = "Cancel Behavior";
"ESC 键取消轮盘" = "ESC cancels wheel";
"鼠标右键取消轮盘" = "Right click cancels wheel";
"模拟目标窗口区域" = "Simulated target window area";
"圆角" = "Corner";
"边框" = "Border";
"内边距" = "Padding";

"为 8 个方向配置窗口尺寸；方向只用于选择，不会把窗口移动到对应角落。" = "Configure window sizes for 8 directions; directions only select actions and do not move windows to corners.";
"配置管理" = "Configuration Management";
"恢复默认分配" = "Restore Default Assignments";
"导出" = "Export";
"导入" = "Import";
"导出配置" = "Export Configuration";
"导入配置" = "Import Configuration";
"完成" = "Done";
"配置文件格式无效：%@" = "Invalid configuration format: %@";
"可视化编辑器" = "Visual Editor";
"%@ 槽位" = "%@ Slot";
"尺寸" = "Size";
"显示名称（可选）" = "Display name (optional)";
"自定义尺寸" = "Custom Size";
"宽度" = "Width";
"高度" = "Height";
"仅修改窗口大小，窗口位置由设置中的锚点规则决定。" = "Only changes the window size. Position follows the anchor rule in settings.";
"调整规则" = "Resize Rule";
"选择该槽位后，Sized 会把当前焦点窗口改为选中的宽高，并尽量保持当前位置关系。" = "When this slot is selected, Sized resizes the focused window to the selected width and height while preserving its position relationship where possible.";
"取消" = "Cancel";

"为指定 App 配置独立轮盘分配；没有命中规则时使用默认尺寸分配。" = "Configure per-app wheel assignments. Default size assignments are used when no rule matches.";
"规则开关" = "Rule Switch";
"启用应用规则" = "Enable app rules";
"规则列表" = "Rule List";
"还没有应用规则" = "No app rules yet";
"未命名 App" = "Unnamed App";
"手动添加" = "Add Manually";
"添加 App 规则" = "Add App Rule";
"匹配设置" = "Match Settings";
"启用此规则" = "Enable this rule";
"App 名称" = "App Name";
"复制默认分配" = "Copy Default Assignments";
"恢复默认" = "Restore Default";
"删除规则" = "Delete Rule";
"规则详情" = "Rule Details";
"选择一个规则，或添加当前前台 App。" = "Select a rule or add the current foreground app.";
"新应用规则" = "New App Rule";

"通用设置" = "General Settings";
"登录时自动启动" = "Launch at login";
"在菜单栏中显示图标" = "Show icon in menu bar";
"隐藏 Dock 图标" = "Hide Dock icon";
"辅助功能权限" = "Accessibility Permission";
"已获得辅助功能权限" = "Accessibility permission granted";
"需要辅助功能权限才能调整其他应用窗口" = "Accessibility permission is required to resize other apps' windows";
"重新检查" = "Check Again";
"打开系统设置" = "Open System Settings";
"刷新" = "Refresh";
"触发键" = "Trigger Key";
"快捷键" = "Shortcut";
"使用 Option 键作为触发键" = "Use Option key as trigger";
"Option 位置" = "Option side";
"触发延迟" = "Trigger delay";
"双击触发键激活轮盘" = "Double tap trigger key to activate wheel";
"鼠标中键激活轮盘" = "Middle click activates wheel";
"行为设置" = "Behavior Settings";
"确认方式" = "Confirmation mode";
"窗口调整动画" = "Window resize animation";
"启用窗口动画" = "Enable window animation";
"窗口动画时长" = "Window animation duration";
"改尺寸锚点" = "Resize anchor";
"忽略全屏窗口" = "Ignore full-screen windows";
"触觉反馈" = "Haptic feedback";
"窗口调整诊断日志" = "Window resize diagnostic logs";
"重置与支持" = "Reset & Support";
"重置所有设置" = "Reset All Settings";
"确定要重置所有设置吗？" = "Are you sure you want to reset all settings?";
"版本 %@ (%@)" = "Version %@ (%@)";
"按下快捷键..." = "Press shortcut...";

"系统" = "System";
"自定义" = "Custom";
"无动画" = "No Animation";
"平滑" = "Smooth";
"弹性" = "Spring";
"松开触发键" = "Release trigger key";
"点击确认" = "Click to confirm";
"保持当前中心" = "Keep current center";
"保持左上角" = "Keep top-left";
"左侧 Option" = "Left Option";
"右侧 Option" = "Right Option";
"两侧 Option" = "Both Option keys";

"左上" = "Top Left";
"上" = "Up";
"右上" = "Top Right";
"左" = "Left";
"中心" = "Center";
"中" = "Center";
"右" = "Right";
"左下" = "Bottom Left";
"下" = "Down";
"右下" = "Bottom Right";

"辅助操作" = "Utility Actions";
"竖向 900 x 1200" = "Portrait 900 x 1200";
"手机竖屏 390 x 844" = "Phone Portrait 390 x 844";
"手机横屏 844 x 390" = "Phone Landscape 844 x 390";
"平板竖屏 768 x 1024" = "Tablet Portrait 768 x 1024";
"平板横屏 1024 x 768" = "Tablet Landscape 1024 x 768";
"恢复初始尺寸" = "Restore Initial Size";
"撤销上一次尺寸" = "Undo Last Size";
"无操作" = "No Action";

"没有可调整的窗口" = "No resizable window";
"选中 %@" = "Selected %@";
"轮盘" = "Wheel";
"无窗口" = "No Window";
"恢复" = "Restore";
"撤销" = "Undo";
"无" = "None";
